using System;

namespace _06._Exam_Results
{
    class Program
    {
        static void Main(string[] args)
        {
            //До получаване на команда "Midnight" ще получавате име на студент.
            //След това ще прочитате резултат в точки[-100, 100] за всяка от 6 - те задачи, всеки на отделен ред. 
            //Ако получите отрицателни точки, това означава, че студентът е санкциониран за преписване. В този случай принтирайте: 
            //"{име на студент} was cheating!" и прекратене четенето на последващи точки като преминете на следващ студент.
            //След получаване на 6 - те точки, приравнете получения сбор към 100 точки, закръглено до по - малкото цяло число. 
            //Изчислете оценката по следната формула: { точки приравнени към 100}
            //            *0.06
            //Всяка оценка под 3 се счита за 2.00.
            //Ако студентът е изкарал над 5 включително, принтирайте сертификат на студента:
            //"==================="
            //"|   CERTIFICATE   |"
            //"|    {оценка}/6.00    |"
            //"==================="
            //"Issued to {име на студент}"
            //В противен случай принтирайте името на студента и оценката му:
            //"{име на студент} - {оценка}"
            //Вход:
            //•	До получаване на "Midnight" ще получавате:
            //o Име на студент: string
            //o   На следващите 6 реда ще получавате точки на задача: цяло число[-100, 100]. 
            //o Ако получите отрицателни точки, санкция за преписване, принтирайте:
            //            "{име на студент} was cheating!"
            //и преустановете четенето на точки за текущия студент.
            //Изход:
            //•	Ако финалната оценка на студента е по - голяма от 5, включително, принтирайте:
            //            "==================="
            //"|   CERTIFICATE   |"
            //"|    {оценка}/6.00    |"
            //"==================="
            //"Issued to {име на студент}"
            //•	Ако оценката е по-малка от 5, принтирайте:
            //            "{име на студент} - {оценка}"
            //•	Оценката форматирайте до втория знак след десетичната запетая. 
            

            string nameStudent = Console.ReadLine();

            while (nameStudent != "Midnight")
            {
                int points = 0;
                double total = 0.0;
                double totalPoints = 0;
                double grade = 0;
                for (int i = 1; i <= 6; i++)
                {
                    points = int.Parse(Console.ReadLine());
                    total += points;
                    if (points < 0)
                    {
                        Console.WriteLine($"{nameStudent} was cheating!");
                        break;
                    }
                }                
                totalPoints = Math.Floor(total / 600 * 100) * 100;
                grade = totalPoints * 0.06 / 100;
                if (grade >= 5)
                {
                    Console.WriteLine("===================");
                    Console.WriteLine("|   CERTIFICATE   |");
                    Console.WriteLine($"|    {grade:f2}/6.00    |");
                    Console.WriteLine("===================");
                    Console.WriteLine($"Issued to {nameStudent}");
                }
                if (grade < 5 && grade >= 3)
                {
                    Console.WriteLine($"{nameStudent} - {grade:f2}");
                }
                if (grade < 3 && grade > 1)
                {
                    Console.WriteLine($"{nameStudent} - 2.00");
                }
                nameStudent = Console.ReadLine();
            }
        }
    }
}
